БИТУправление_медицинским_центром_демо/src/Catalogs/РазделыМедицинскихКарт/РазделыМедицинскихКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыМедицинскихКарт</name>
  <attributes>
    <name>ТипРаздела</name>
    <type>
      <types>EnumRef.ТипыРазделовМедицинскихКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМедкарты</name>
    <type>
      <types>EnumRef.ТипыМедицинскихКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЗаголовокРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьШаблоныБезРазделов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьРезультатыАнализовБезШаблона</name>
    <comment>Основание определяется по реквизиту &quot;Основание&quot;)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/РазделыМедицинскихКарт/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Порядок = 0; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Индекс = ПроверяемыеРеквизиты.Найти("Порядок");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Порядок = 0 Тогда 
		Порядок = Справочники.РазделыМедицинскихКарт.ПолучитьПорядковыйНомер(ТипМедкарты, Ссылка);	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
